bm-test-manual.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.6" jmeter="2.11 r1554548">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="jMeter User" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">250</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1392130925000</longProp>
        <longProp name="ThreadGroup.end_time">1392130925000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="jp@gc - Throughput Shaping Timer" enabled="true">
          <collectionProp name="load_profile">
            <collectionProp name="130315">
              <stringProp name="49">1</stringProp>
              <stringProp name="1722">60</stringProp>
              <stringProp name="53">5</stringProp>
            </collectionProp>
            <collectionProp name="1739613">
              <stringProp name="1722">60</stringProp>
              <stringProp name="1722">60</stringProp>
              <stringProp name="1598">20</stringProp>
            </collectionProp>
            <collectionProp name="3193983">
              <stringProp name="1722">60</stringProp>
              <stringProp name="48687">120</stringProp>
              <stringProp name="53">5</stringProp>
            </collectionProp>
            <collectionProp name="48328893">
              <stringProp name="48687">120</stringProp>
              <stringProp name="48687">120</stringProp>
              <stringProp name="1598">20</stringProp>
            </collectionProp>
            <collectionProp name="48333114">
              <stringProp name="48687">120</stringProp>
              <stringProp name="48873">180</stringProp>
              <stringProp name="53">5</stringProp>
            </collectionProp>
            <collectionProp name="48513405">
              <stringProp name="48873">180</stringProp>
              <stringProp name="48873">180</stringProp>
              <stringProp name="1598">20</stringProp>
            </collectionProp>
            <collectionProp name="48537807">
              <stringProp name="48873">180</stringProp>
              <stringProp name="49710">240</stringProp>
              <stringProp name="53">5</stringProp>
            </collectionProp>
            <collectionProp name="49343709">
              <stringProp name="49710">240</stringProp>
              <stringProp name="49710">240</stringProp>
              <stringProp name="1598">20</stringProp>
            </collectionProp>
            <collectionProp name="49368111">
              <stringProp name="49710">240</stringProp>
              <stringProp name="50547">300</stringProp>
              <stringProp name="53">5</stringProp>
            </collectionProp>
            <collectionProp name="50174013">
              <stringProp name="50547">300</stringProp>
              <stringProp name="50547">300</stringProp>
              <stringProp name="1598">20</stringProp>
            </collectionProp>
          </collectionProp>
          <intProp name="expected_max_throughput">50000</intProp>
          <intProp name="expected_duration">175</intProp>
        </kg.apc.jmeter.timers.VariableThroughputTimer>
        <hashTree/>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">ec2-54-85-174-106.compute-1.amazonaws.com</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.concurrentPool">4</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <io.magnum.jmeter.ext.NonGuiThroughputCollector guiclass="io.magnum.jmeter.ext.NonGuiThroughputCollectorGui" testclass="io.magnum.jmeter.ext.NonGuiThroughputCollector" testname="@Magnum Non-Gui Throughput Collector" enabled="true">
          <collectionProp name="MONITORED_HOSTS">
            <collectionProp name="-1596800513">
              <stringProp name="-418650420">ec2-54-85-174-106.compute-1.amazonaws.com</stringProp>
            </collectionProp>
          </collectionProp>
        </io.magnum.jmeter.ext.NonGuiThroughputCollector>
        <hashTree/>
        <ResultCollector guiclass="kg.apc.jmeter.vizualizers.SummaryReport" testclass="ResultCollector" testname="jp@gc - Yu&apos;s Summary" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>        
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Config" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/json</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>